export default [
  {
    id: 'q1',
    text: 'Какое из приведенных ниже определений наилучшим образом описывает React.js?',
    answers: [
      'Библиотека для создания пользовательских интерфейсов с помощью декларативного кода.',
      'Библиотека для управления состоянием веб-приложений.',
      'Фреймворк для создания пользовательских интерфейсов с помощью императивного кода.',
      'Библиотека, используемая только для создания мобильных приложений',
    ],
  },
  {
    id: 'q2',
    text: 'Какой цели служат хуки React?',
    answers: [
      'Включение использования state и других функций React в функциональных компонентах.',
      'Создание адаптивных макетов в приложениях React.',
      'Обработка ошибок в приложении.',
      'Часть библиотеки Redux для управления глобальным состоянием.',
    ],
  },
  {
    id: 'q3',
    text: 'Можете ли вы определить, что такое JSX?',
    answers: [
      'Расширение JavaScript, которое добавляет HTML-подобный синтаксис в JavaScript.',
      'Библиотека JavaScript для создания динамических пользовательских интерфейсов.',
      'Специальная версия HTML, которая была явно создана для React.',
      'Инструмент для выполнения HTTP-запросов в приложении React.',
    ],
  },
  {
    id: 'q4',
    text: 'Каков наиболее распространенный способ создания компонента в React?',
    answers: [
      'Определив функцию JavaScript, которая возвращает отображаемое значение.',
      'Определив пользовательский HTML-тег в JavaScript.',
      'Создав файл с расширением .jsx.',
      'Используя ключевое слово "new", за которым следует название компонента.',
    ],
  },
  {
    id: 'q5',
    text: 'Что подразумевает термин "реактивное состояние"?',
    answers: [
      'Объект в компоненте, который содержит значения и может вызывать рендеринг компонента при изменении.',
      'Фаза жизненного цикла, в которой находится компонент React.',
      'Общее состояние приложения React, включая все реквизиты и компоненты.',
      'Библиотека для управления глобальным состоянием в приложениях React.',
    ],
  },
  {
    id: 'q6',
    text: 'Как вы обычно визуализируете содержимое списка в приложениях React?',
    answers: [
      'Используя метод map() для перебора массива данных и возврата JSX.',
      'Используя цикл for() для перебора массива данных и возврата JSX.',
      'Используя метод forEach() для перебора массива данных и возврата JSX.',
      'Используя метод loop() для перебора массива данных и возврата JSX.',
    ],
  },
  {
    id: 'q7',
    text: 'Какой подход нельзя использовать для условного отображения контента?',
    answers: [
      'Используя синтаксис шаблона #if.',
      'Используя троичный оператор.',
      'Используя оператор &&.',
      'Используя оператор if-else.',
    ],
  },
];
